//
//  Extension.swift
//  ToDoApp
//
//  Created by yuji nakamoto on 2020/11/25.
//

import Foundation
import UIKit

extension UIViewController {

    func setSwipeBack() {
        let target = self.navigationController?.value(forKey: "_cachedInteractionController")
        let recognizer = UIPanGestureRecognizer(target: target, action: Selector(("handleNavigationTransition:")))
        self.view.addGestureRecognizer(recognizer)
    }
}

public let generator = UINotificationFeedbackGenerator()

public var itemArray = ["アイスクリーム","アルミホイル","アクエリアス","甘酒","揚げ出し豆腐","甘エビ","アボガド","揚げ玉","甘口醤油","あさり","鯵","穴子","いちご","いちごジャム","鰯","芋","いくら","胃薬","糸こんにゃく","いんげん豆","いなり寿司","ウインナー","ウェットティッシュ","ウイスキー","ウォッカ","烏龍茶","うどん","梅酒サワー","海老","えびフィレオ","エリンギ","枝豆","エスプレッソ","オロナミンC","オリーブオイル","おにぎり","お米","オレンジ","オクラ","オレンジジュース","温泉たまご","お好み焼きソース","かぼちゃ","カルピス","カップヌードル","カイワレ大根","海鮮サラダ","唐揚げ","数の子","片栗粉","かぜ薬","かゆみ止め","辛子明太子","キャベツ","キムチ","きゅうり","キクラゲ","クッキー","クリーム","クレープ","クロワッサン","クリームコロッケ","ケッチャプ","ケーキ","消しゴム","化粧水","ゴミ袋","コカ・コーラ","コンソメ","こんにゃく","コリアンダー","コシヒカリ","コーンフレーク","小麦粉","濃口醤油","高野豆腐","サーモン","さくらんぼ","サーターアンダギー","さつま揚げ","皿うどん","さつまいも","シャープペン","砂糖","サラダオイル","サランラップ","サイコロステーキ","サンドイッチ","シュークリーム","椎茸","シャンプー","ししゃも","シュウマイ","シリアル","柔軟剤","C.C.レモン","ショートケーキ","生姜","食パン","醤油","塩コショウ","焼酎","スパゲティー","スパイス","スナック菓子","接着剤","せんべい","洗剤","ソース","素麺","ソーセージ","ソフトクリーム","惣菜","惣菜パン","蕎麦","玉ねぎ","卵","たこわさび","タバスコ","たこ焼き","タピオカミルクティー","たこ焼きソース","タン塩","タオル","たくあん","タンドリーチキン","チョコレート","ティッシュ","チーズ","チキンナゲット","チキンラーメン","チューハイ","ちりめんじゃこ","中華スープ","ツナフレーク","漬物","爪楊枝","つぶあん","テキーラ","ティラミス","テリヤキバーガー","天然水","天かす","天ぷら","手羽先","トマト","とうもろこし","トリュフ","トイレットペーパー","鶏肉","唐辛子","豆板醤","豆腐","豚汁","鶏がらスープ","豆乳","茄子","生クリーム","ナンプラー","生ハム","納豆","ナタデココ","生ビール","ニンジン","ニンニク","煮干し","乳液","人参","熱さまシート","海苔","ノンアルコールビール","野沢菜","ハイボール","春巻き","歯磨き粉","歯ブラシ","はちみつ","ハンバーグ","ハーブ","ハンバーガー","ハーブティー","冷奴","漂白剤","ひき肉","ビニール袋","ひじき","冷やし中華","フランクフルト","フォアグラ","フルーツ","フカヒレ","フレーク","フライドポテト","フライドチキン","フィレオフィッシュ","フライドオニオン","ヘアワックス","ヘアスプレー","芳香剤","ほうれん草","ほうじ茶","ほんだし","ホイップクリーム","ホットケーキミックス","ホワイトソース","ホットック","ホルモン","マーマレード","マシュマロ","マカロニ","マッシュルーム","マヨネーズ","マスカット","抹茶","まぐろ","松茸","マスタード","舞茸","マジックリン","饅頭","マンゴー","三ツ矢サイダー","ミートボール","みりん","味噌汁","ミートスパゲティ","ミルクティー","ミネラルウォーター","味噌","麦茶","麦飯","むね肉","メープルシロップ","綿棒","明太子","メロン","メロンパン","メガマフィン","めんつゆ","メロンソーダ","もも肉","モッツァレラ","モンブラン","もやし","モスコミュール","モンスターエナジー","野菜","油淋鶏","U.F.O.","やきそば","ユッケ","ゆずサワー","雪見だいふく","柚子はちみつ","ヨーグルト","吉野家","洋食","ラー油","ラーメン","ライチ","ライム","リンゴ","リンス","緑茶","ルウカレー","ルッコラ","レーズン","レタス","レンコン","冷麺","レアチーズケーキ","レモン","練乳","レッドブル","冷凍食品","ロールパン","ローストビーフ","ローストチキン","ロコモコ","ロマネコンティ","ローズヒップティー","わさび","割り箸","わかめ","ワッフル","ワンタン","ワイン","ワックス","ガーリック","ガレット","ガラムマサラ","ガトーショコラ","ガナッシュ","牛肉","牛乳","餃子","餃子タレ","魚肉ソーセージ","銀杏","牛タン","牛丼","魚介類","グラノーラ","グラタン","グレープフルーツ","グリンピース","グレープ","グリーンカレー","グアバ","玄米","玄米フレーク","玄米パン","激辛カレー","激辛ソース","げそフライ","ゴーヤー","ごまラー油","ごはん","ゴボウ","ごま塩","ゴーフレット","ゴディバ","ゴマだれ","ザーサイ","ざる蕎麦","ざるうどん","雑穀米","柘榴","ザンギ","ざらめ砂糖","ジュース","ジャーキー","ジャム","ジンジャエール","じゃがいも","ジャスミン茶","ゼリー","ぜんざい","全粒粉","雑炊","ダージリン","大根","大豆","大福","だし昆布","ダブルチーズバーガー","ダイエットコーラ","デミグラスソース","デザート","電池","ドーナツ","ドリンク","ドライフルーツ","ドレッシング","ドンタコス","どら焼き","ドンペリ","バームクーヘン","バーボン","バニラアイス","バジル","バナナ","ババロア","バーニャカウダ","バター","バルサミコ酢","ビーフカレー","ビッグマック","ビスケット","ブイヨン","ブランデー","ブロッコリー","ブルーベリー","ブラックペッパー","ブルーチーズ","豚肉","豚バラ","豚キムチ","ベーコン","ベーグル","ベイクド","ボディーソープ","ボールペン","パイナップル","パンケーキ","パルメザンチーズ","パプリカ","パパイヤ","パンナコッタ","パスタ","パスタソース","パン粉","パイタンスープ","ピーナッツ","ピスタチオ","ピーマン","ピザソース","プリン","プチトマト","プロテイン","プレミアムビール","ペペロンチーノ","ポタージュ","ポテトチップス","ポカリスエット","ポン酢","ポン・デ・リング"]


public let aArray = ["油","アイスクリーム","甘酒","揚げ出し豆腐","甘エビ","アボガド","揚げ玉","甘口醤油","あさり","鯵","穴子"]
public let iArray = ["イカ","いちご","鰯","芋","いくら","糸こんにゃく","いんげん豆","いなり寿司"]
public let uArray = ["ウインナー","ウイスキー","ウォッカ","烏龍茶","うどん","梅酒サワー"]
public let eArray = ["海老","エリンギ","枝豆","エスプレッソ"]
public let oArray = ["オリーブオイル","おにぎり","オレンジ","オレンジジュース","お茶","温泉たまご","お好み焼きソース"]

public let kaArray = ["南瓜","カイワレ大根","海鮮サラダ","唐揚げ","数の子","片栗粉","辛子明太子"]
public let kiArray = ["キャベツ","キムチ","きゅうり","巨峰サワー","キクラゲ"]
public let kuArray = ["クッキー","クリーム","クレープ","黒烏龍茶","クロワッサン","クリームコロッケ"]
public let keArray = ["ケッチャプ","ケーキ"]
public let koArray = ["コカ・コーラ","コンソメ","こんにゃく","コリアンダー","コシヒカリ","小麦粉","高野豆腐"]

public let saArray = ["サーモン","さくらんぼ","サーターアンダギー","さつま揚げ","皿うどん","さつまいも","サラダオイル","サイコロステーキ"]
public let siArray = ["シュークリーム","椎茸","ししゃも","シュウマイ","シリアル","ショートケーキ","生姜","食パン","醤油","塩コショウ","焼酎"]
public let suArray = ["スパゲティー","スパイス","スナック菓子"]
public let seArray = ["煎餅"]
public let soArray = ["ソース","素麺","ソーセージ","ソフトクリーム","惣菜","惣菜パン","蕎麦"]

public let taArray = ["玉ねぎ","卵","たこわさび","タバスコ","たこ焼き","タピオカミルクティー","たこ焼きソース","タン塩","タンドリーチキン"]
public let tiArray = ["チョコレート","チーズ","チキンナゲット","チキンラーメン","チューハイ","ちりめんじゃこ","中華スープ"]
public let tuArray = ["ツナフレーク","漬物","つぶあん"]
public let teArray = ["テキーラ","ティラミス","テリヤキバーガー","天然水","天かす","天ぷら","手羽先"]
public let toArray = ["トマト","とうもろこし","トリュフ","鶏肉","唐辛子","豆板醤","豆腐","豚汁","鶏がらスープ","豆乳"]

public let naArray = ["茄子","生クリーム","ナンプラー","生ハム","納豆","ナタデココ","生ビール"]
public let niArray = ["ニンジン","ニンニク","煮干し","人参"]
public let noArray = ["海苔","ノンアルコールビール","野沢菜"]

public let haArray = ["ハイボール","春巻き","ハイボール","はちみつ","ハンバーグ","ハーブ","ハーブティー"]
public let hiArray = ["冷奴","ひき肉","ひじき","冷やし中華"]
public let huArray = ["フランクフルト","フォアグラ","フルーツ","フカヒレ","フレーク","フライドポテト","フライドチキン","フィレオフィッシュ","フライドオニオン"]
public let hoArray = ["ほうれん草","ほうじ茶","ホイップクリーム","ホワイトソース    ","ホットック","ホルモン"]

public let maArray = ["マーマレード","マシュマロ","マッシュルーム","マヨネーズ","マスカット","抹茶","マグロ","松茸","マスタード","舞茸","饅頭","マンゴー"]
public let miArray = ["ミートボール","みりん","味噌汁","マヨネーズ","ミートスパゲティ","ミルクティー","味噌"]
public let muArray = ["麦茶","麦飯"]
public let meArray = ["メープルシロップ","明太子","メロン","メロンパン","メガマフィン","めんつゆ","メロンソーダ","麺類"]
public let moArray = ["モッツァレラ","モンブラン","もやし","モスコミュール"]

public let yaArray = ["野菜"]
public let yuArray = ["油淋鶏","ユッケ","ゆずサワー","雪見だいふく","柚子はちみつ"]
public let yoArray = ["ヨーグルト","吉野家","洋食"]

public let raArray = ["ラー油","ラーメン","ライチ","ライム","リンゴ","緑茶","ルウカレー","ルッコラ","レーズン","レタス","レンコン","冷麺","レアチーズケーキ","レモン","練乳","レッドブル","ロールパン","ローストビーフ","ローストチキン","ロコモコ","ロマネコンティ","ローズヒップティー"]

public let waArray = ["わさび","わかめ","ワッフル","ワンタン","ワイン"]

public let gaArray = ["ガーリック","ガレット","ガラムマサラ","ガトーショコラ","ガナッシュ"]
public let giArray = ["牛肉","牛乳","餃子","餃子タレ","魚肉ソーセージ","銀杏","牛タン","牛丼","魚介類"]
public let guArray = ["グラノーラ","グラタン","グレープフルーツ","グリンピース","グレープ","グリーンカレー","グアバ"]
public let geArray = ["玄米","玄米フレーク","玄米パン","激辛カレー","激辛ソース   ","げそフライ"]
public let goArray = ["ゴーヤー","ごまラー油","ごはん","ゴボウ","ごま塩","ゴーフレット","ゴディバ","ゴマだれ"]

public let zaArray = ["ザーサイ","ざる蕎麦","ざるうどん","雑穀米","柘榴","ザンギ","ざらめ砂糖","ジュース","ジャーキー","ジャム","ジンジャエール","じゃがいも","ジャスミン茶","ゼリー","ぜんざい","全粒粉","雑炊"]

public let daArray = ["ダージリン","大根","大豆","大福","だし昆布","ダブルチーズバーガー","ダイエットコーラ","デミグラスソース","デザート","ドーナツ","ドリンク","ドライフルーツ","ドレッシング","ドンタコス","どら焼き","ドンペリ"]

public let baArray = ["バームクーヘン","バーボン","バニラアイス","バジル","バナナ","ババロア","バーニャカウダ","バター","バルサミコ酢","ビーフカレー","ビール","ビスケット","ブイヨン","ブランデー","ブロッコリー","ブルーベリー","ブラックペッパー","ブルーチーズ","豚肉","豚バラ","豚キムチ","ベーコン","ベーグル","ベイクド"]

public let paArray = ["パイナップル","パンケーキ","パルメザンチーズ","パプリカ","パパイヤ","パンナコッタ","パスタ","パスタソース","パン粉","パイタンスープ","ピーナッツ","ピスタチオ","ピーマン","ピザソース","プリン","プレミアムビール","ペペロンチーノ","ポタージュ","ポテトチップス","ポン酢","ポン・デ・リング"]
